<script setup>
import { ref, onMounted } from "vue";

// 페이지 메타 설정
definePageMeta({
  layout: "default-none",
  name: "terms-service"
});

const jsonData = {
  terms:
    '홈넘버 서비스 이용 약관\n\n제1조(목적) \n이 약관은 홈넘버 주식회사(이하 “회사”라고 합니다.) 가 판매하는 홈넘버 서비스(이하“서비스”라고 합니다.) 를 이용함에 있어 이용자의 권리의무 및 책임사항을 규정함을 목적으로 합니다.\n\n제2조(정의) \n①\t“홈넘버”라 함은 고객의 이름, 핸드폰번호, 주소를 대체하는 숫자를 의미합니다.\n②\t“서비스”란 개인정보유출피해를 막아주고 고객 편의를 증진하기 위하여 홈넘버 주식회사가 제휴업체를 통해 제공하는 홈넘버 서비스를 말합니다.\n③\t“회원”이라 함은 “회사”의 “서비스”를 이용하기 위해 약관에 따라 “회사”와 이용 계약을 체결하고 “회사”가 제공하는 “서비스”를 이용하는 고객을 말합니다.\n④\t“구독회원”이라 함은 회원이 “회사”가 제공하는 “서비스”를 이용하기 위해, 상품을 구매하는 등의 권리를 득하여 콘텐츠 등 유무형의 재화 또는 용역을 이용하는 자를 의미합니다.\n⑤\t“웹사이트”라 함은 “회사”가 “회원”에게 정보를 제공하고 “서비스” 가입비 결제 및 월 사용료 정기 결제를 등록하기 위한 회사의 웹사이트를 말합니다.\n\n제3조(약관 등의 명시와 설명 및 개정) \n ① 본 약관에서 정하지 아니한 사항과 본 약관의 해석에 관하여는 전자상거래 등에서의 소비자보호에 관한 법률, 약관의 규제 등에 관한 법률, 공정거래위원회가 정하는 전자상거래 등에서의 소비자 보호지침 및 관계법령 또는 상관례에 따릅니다.\n ② 회사는 「전자상거래 등에서의 소비자보호에 관한 법률」, 「약관의 규제에 관한 법률」, 「전자문서 및 전자거래기본법」, 「전자금융거래법」, 「전자서명법」, 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」, 「방문판매 등에 관한 법률」, 「소비자기본법」 등 관련 법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.\n ③ 회사는 본 약관을 개정하는 경우 개정내용과 적용일자를 명시하여 제8조의 방법으로 7일 전부터 적용일자 전까지 공지합니다.다만, 변경 내용이 이용자에게 불리한 변경의 경우에는 개정약관의 적용일자 30일 전부터 적용일자까지 공지합니다.\n ④ 구독회원이 개정약관에 동의하지 않는 경우에는 개정 약관의 적용일 이전에 거부 의사를 표시하고 본 약관에 의한 이용계약을 해지할 수 있습니다.\n ⑤ 회사가 본 조 제3항에 따라 개정약관을 공지 하면서 구독회원에게 적용일 전까지 의사표시를 하지 않으면 의사표시가 표명된 것으로 본다는 뜻을 명확하게 공지 하였음에도 불구하고 구독회원이 명시적으로 거부의사를 표명하지 아니한 경우 개정약관에 동의한 것으로 봅니다.\n\n제4조(서비스의 제공 및 변경) \n①\t회사는 다음과 같은 서비스를 제공합니다.\n1) \t“홈넘버”를 활용한 쇼핑 및 택배서비스 이용\n2) \t“홈넘버”를 활용한 우편서비스 이용\n3) \t“홈넘버”를 활용한 결제 및 배송 통합 서비스\n4) \t기타 “회사”가 정하는 서비스\n②\t본 조 제1항 제1호에서 제3호까지의 서비스 구성과 그 내용은 “회사”가 정합니다.\n③\t본 조 제1항의 서비스 범위는 “회사”가 제휴한 업체로 국한되고, “회사” 또는 제휴업체의 사정에 따라 달라질 수 있습니다.\n④\t“회사”는 본 조 제1항 각 호에서 정한 서비스 내용을 추가, 변경 또는 중단할 수 있습니다.이 경우 그 내용을 고객에게 알리고 “회사”의 웹사이트, 문자 알림, E- mail 등을 통해 “회원”에게 사전 공지하여 드립니다.\n\n제5조(서비스의 중단) \n①\t“회사”는 천재지변 또는 이에 준하는 불가항력, 컴퓨터 등 정보통신설비의 보수·점검·교체, 고장, 통신의 두절 등의 사유가 발생한 경우에 상품 혹은 콘텐츠의 제공을 일시적으로 중단할 수 있습니다.\n②\t“회사” 또는 제휴업체가 해킹 등을 당하여 회원에게 피해가 발생할 우려가 있는 경우\n③\t회원이 본 약관의 규정 및 기타 관련 법규를 위반하는 경우\n\n제6조(회원가입) \n①\t이용자는 “회사” 가 정한 가입 양식에 따라 회원정보를 기입한 후 이 약관에 동의한다는 의사표시를 함으로서 회원가입을 신청하고, “회사”가 이러한 신청을 승낙함으로써 “회원가입” 및 “이용계약” 체결이 완료됩니다.\n②\t“회사”는 제1항과 같이 “회원”으로 가입할 것을 신청한 자에 대하여 다음 각 호에 해당하지 않는 한 “회원”으로 등록합니다.\n1) \t이전에 회원자격을 상실한 적이 있는 경우.다만, 재가입 조건이 충족되어 “회사”의 회원재가입 승낙을 얻은 경우에는 예외로 합니다.\n2) \t등록 내용에 허위, 기재누락, 오기가 있는 경우\n3) \t실명이 아니거나 타인의 명의를 이용한 경우\n4) \t“회원”으로 등록하는 것이 “회사”의 “서비스”의 정상적인 제공을 저해하거나 다른 회원의 “서비스” 이용에 지장을 줄 것으로 예상되는 경우\n5) \t만 14세 미만일 경우\n③\t회원가입계약의 성립 시기는 “회사”의 승낙이 회원에게 도달한 시점으로 합니다.\n④\t회원은 회원가입 시 등록한 사항에 변경이 있는 경우, 상당한 기간 이내에 “회사”에 대하여 회원정보 수정 등의 방법으로 그 변경사항을 알려야 합니다.\n\n제7조(회원 탈퇴 및 자격 상실 등) \n①\t“회원”은 “회사”에 언제든지 탈퇴를 요청할 수 있으며 “회사”는 즉시 회원탈퇴를 처리합니다.단, 회원탈퇴 시 발급한 “홈넘버”도 모두 삭제됩니다.\n②\t회원탈퇴 시 회원정보는 지체 없이 파기합니다.다만, 다음 사유의 경우에는 아래의 보존 이유를 위해 명시한 기간 동안 보존합니다.\n1) \t관계법령에 근거한 정보보유 사유\n가) \t계약 또는 청약철회 등에 관한 기록\n보존 이유: 전자상거래 등에서의 소비자보호에 관한 법률\n보존 기간: 회계연도 기준 5년\n나) \t대금결제 및 재화 등의 공급에 관한 기록\n보존 이유: 전자상거래 등에서의 소비자보호에 관한 법률\n보존 기간: 회계연도 기준 5년\n다) \t소비자 불만 또는 분쟁처리에 관한 기록\n보존 이유: 전자상거래 등에서의 소비자보호에 관한 법률\n보존 기간: 3년\n라) \t웹사이트 방문 기록\n보존 이유: 통신비밀보호법\n보존 기간: 3개월\n마) \t기타 국세기본법, 소비자기본법, 제조물책임법 등\n③\t“회원”이 다음 각 호의 사유에 해당하는 경우, “회사”는 회원자격을 제한 및 정지시킬 수 있습니다.\n1) \t가입 신청 시에 허위 내용을 등록하거나 타인을 정보를 도용한 경우\n2) \t“회사”를 이용하여 구입한 재화 등의 대금, 기타 서비스 이용에 관련하여 “회원”이 부담하는 채무를 기일에 지급하지 않는 경우\n3) \t다른 사람의 회사 이용을 방해하거나 그 정보를 도용하는 등 전자상거래 질서를 위협하는 경우\n4) \t“회사”를 이용하여 법령 또는 이 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우\n5) \t다음 각 목에 해당하는 행위를 하여 회사의 건전한 경영과 서비스 운영을 방해하는 경우\n가) \t“회사”에 대한 근거 없는 허위의 사실을 유포하여 회사의 명예를 실추시키는 경우\n나) \t구입한 상품, 서비스에 하자가 없음에도 일부 사용 후 부당한 반품을 요청하거나 상습적인 취소, 반품으로 “회사”의 업무를 방해하는 경우\n다) \t리뷰(Q & A, 게시글 포함)의 불량글 신고로 인해 임의삭제 및 게시중단 조치를 3회 이상 반복하여 받은 경우\n라) \t“회사”의 직원에 대한 모욕, 폭언, 협박, 성희롱 등으로 “회사”의 업무 운영을 방해하는 경우\n마) \t소비자원이 고시한 소비자분쟁해결기준을 초과하는 과도한 보상을 상습적으로 요청하는 경우\n④\t“회사”가 회원 자격을 제한․정지 시킨 후, 동일한 행위가 2회 이상 반복되거나 30일 이내에 그 사유가 시정되지 아니하는 경우 “회사”는 회원자격을 상실시킬 수 있습니다.\n⑤\t“회사”가 회원자격을 상실시키는 경우에는 회원등록을 말소합니다.이 경우 “회원”에게 이를 통지하고, 회원등록 말소 전에 최소한 30일 이상의 기간을 정하여 소명할 기회를 부여합니다.\n\n제8조(회원에 대한 통지) \n①\t“회사”가 회원에 대한 통지를 하는 경우, 회원이 “회사”와 미리 약정하여 지정한 전자우편 주소로 할 수 있습니다.\n②\t“회사”는 불특정다수 회원에 대한 통지의 경우 1주일이상 “회사” 게시판에 게시함으로써 개별 통지에 갈음할 수 있습니다.다만, 회원 본인의 거래와 관련하여 중대한 영향을 미치는 사항에 대하여는 개별통지를 합니다.\n\n제9조(구매신청 및 개인정보 제공 동의 등) \n①\t“서비스” 이용자는 “웹사이트”상에서 다음 또는 이와 유사한 방법에 의하여 구매를 신청하며, “웹사이트”는 이용자가 구매신청을 함에 있어서 다음의 각 내용을 알기 쉽게 제공하여야 합니다.\n1) \t사용할 홈넘버 입력\n2) \t받는 사람의 성명, 주소, 전화번호, 전자우편주소(또는 이동전화번호) 등의 입력\n3) \t재화 등의 구매신청 및 이에 관한 확인 또는 “웹사이트”의 확인에 대한 동의\n4) \t결제방법의 선택\n②\t“회사”가 제3자에게 구매자 개인정보를 제공할 필요가 있는 경우 \n1) 개인정보를 제공받는 자, \n2)개인정보를 제공받는 자의 개인정보 이용목적, \n3) 제공하는 개인정보의 항목, \n4) 개인정보를 제공받는 자의 개인정보 보유 및 이용기간을 구매자에게 알리고 동의를 받아야 합니다. (동의를 받은 사항이 변경되는 경우에도 같습니다.) \n③\t “회사”가 제3자에게 구매자의 개인정보를 취급할 수 있도록 업무를 위탁하는 경우에는 1) 개인정보 취급위탁을 받는 자, 2) 개인정보 취급위탁을 하는 업무의 내용을 구매자에게 알리고 동의를 받아야 합니다. (동의를 받은 사항이 변경되는 경우에도 같습니다.) 다만, 서비스 제공에 관한 계약이행을 위해 필요하고 구매자의 편의증진과 관련된 경우에는 「개인정보보호법」에서 정하고 있는 방법으로 개인정보 취급방침을 통해 알림으로써 고지절차와 동의절차를 거치지 않아도 됩니다.\n\n제10조(계약의 성립) \n“회사”는 제9조와 같은 구매신청에 대하여 승낙하는 경우 계약이 성립되지만, 다음 각 호에 해당하면 승낙하지 않을 수 있습니다.\n①\t신청 내용에 허위, 기재누락, 오기가 있는 경우\n②\t기타 구매신청에 승낙하는 것이 “웹사이트” 기술상 현저히 지장이 있다고 판단하는 경우\n\n제11조(지급방법) \n웹사이트”에서 구매한 재화 또는 용역에 대한 대금지급방법은 다음 각 호의 방법 중 가용한 방법으로 할 수 있습니다.단, “웹사이트”는 이용자의 지급방법에 대하여 재화 등의 대금에 어떠한 명목의 수수료도 추가하여 징수할 수 없습니다.\n①\t폰뱅킹, 인터넷뱅킹, 메일 뱅킹 등의 각종 계좌이체 \n②\t선불카드, 직불카드, 신용카드 등의 각종 카드 결제\n③\t온라인무통장입금\n④\t전자화폐에 의한 결제\n⑤\t암호화폐에 의한 결제\n⑥\t“회사”와 계약을 맺었거나 “회사”가 인정한 구매권에 의한 결제\n⑦\t기타 전자적 지급 방법에 의한 대금 지급 등\n\n제12조(수신확인통지․구매신청 변경 및 취소) \n①\t“웹사이트”는 이용자의 구매신청이 있는 경우 이용자에게 수신확인통지를 합니다.\n②\t수신확인통지를 받은 이용자는 의사표시의 불일치 등이 있는 경우에는 수신확인통지를 받은 후 즉시 구매신청 변경 및 취소를 요청할 수 있고 “웹사이트”는 이용자의 요청이 있는 경우에는 지체 없이 그 요청에 따라 처리하여야 합니다.다만 이미 대금을 지불한 경우에는 제16조의 청약철회 등에 관한 규정에 따릅니다.\n\n제13조(서비스 이용료) \n①\t“서비스”의 이용과 관련하여 “회원”이 납부해야 할 이용요금은 홈페이지에 게재된 이용요금 또는 개별 약정서에 따릅니다.단, 개별 약정서와 홈페이지에 게재된 이용요금이 상이한 경우 개별 약정서가 우선하여 적용됩니다.\n②\t“회원”이 “서비스” 이용 시 납부하는 이용요금의 종류는 다음과 같습니다.\n -\t가입비: “서비스” 이용 시 최초 납부하는 1회성 요금\n -\t월 이용료: 월 단위의 기본요금\n -\t부가서비스 이용료: 월 이용료 외에 추가사용량 또는 별도의 부가서비스에 대한 요금\n③\t서비스를 이용하고자 하는 “회원”은 서비스 이용의 대가로 “회사”가 정한 서비스 이용료(월 이용료 + 부가서비스 이용료 등)를 “회사”가 정한 결제 방식(매월 신용카드 자동이체 등)으로 납부하여야 합니다.\n④\t선불 서비스를 구매한 “회원”은 해당기간 동안 서비스 이용이 가능합니다.\n⑤\t골드홈넘버(영구적으로 소유하는 홈넘버)를 구매한 “회원”은 모든 서비스 이용료를 영구적으로 면제받습니다.\n⑥\t서비스 이용료는 “회사”의 사정에 따라 변경될 수 있고, 이 경우 변경된 내용은 “회사” 웹사이트 또는 기타의 방법으로 사전에 안내하여 드립니다.\n\n제14조(약정할인) \n①\t“회사”는 고객이 월정액 서비스를 가입하는 경우, 요금 중 일부 금액을 할인(이하 "약정할인"이라 함)하는 조건으로 12~36개월 이하의 의무사용기간(이하 "약정기간"이라 함)을 설정할 수 있습니다.\n②\t약정기간의 설정, 약정할인금액의 산정방식 등에 관한 사항은 “회원”과 “회사” 간 개별계약에 따른다.\n③\t“회사”는 약정기간 또는 영업정책상 필요에 따라 할인금액을 달리할 수 있습니다.\n④\t“회원”이 약정기간 만료 전에 해지하고자 하는 경우, “회원”은 서비스 이용기간 동안 약정할인 받은 전액을 “회사”에 납부해야 합니다.\n\n제15조(면책조항) \n①\t“회사”는 “회원”이 제공한 회원 본인의 정보에 대한 정확성, 진위성, 유효성 확인의 책임이 없고, “회원”이 제공한 정보의 오류로 인한 피해에 대해서 책임을 지지 않습니다.\n②\t“회사”는 천재지변, 파업, 관련 법규의 변경, 관계 기관의 명령 및 지침, 또는 외부로부터 발생한 사건 등 “회사”가 통제할 수 없는 사유로 인하여 서비스 제공이 불가능하거나 현저하게 어려운 경우, 그로 인한 피해에 대해서는 책임지지 않습니다.\n③\t“회사”는 제휴업체의 과실로 인한 지연, 서비스 장애 및 회원의 귀책 사유로 인한 서비스 이용 장애에 대하여 책임을 지지 않습니다.\n\n제16조(청약철회 등)\n①\t“회사”와 재화 등의 구매에 관한 계약을 체결한 이용자는 「전자상거래 등에서의 소비자보호에 관한 법률」 제13조 제2항에 따른 계약내용에 관한 서면을 받은 날(그 서면을 받은 때보다 재화 등의 공급이 늦게 이루어진 경우에는 재화 등을 공급받거나 재화 등의 공급이 시작된 날을 말합니다)부터 7일 이내에는 청약의 철회를 할 수 있습니다. 다만, 청약철회에 관하여 「전자상거래 등에서의 소비자보호에 관한 법률」에 달리 정함이 있는 경우에는 동 법 규정에 따릅니다.\n\n제17조(청약철회 등의 효과)\n①\t“회사”는 “회원”으로부터 재화 등을 반환받은 경우 3영업일 이내에 이미 지급받은 재화 등의 대금을 환급합니다. 이 경우 “회사”가 “회원”에게 재화 등의 환급을 지연한때에는 그 지연기간에 대하여 「전자상거래 등에서의 소비자보호에 관한 법률 시행령」 제21조의2에서 정하는 지연이자율을 곱하여 산정한 지연이자를 지급합니다.\n②\t“회사”는 위 대금을 환급함에 있어서 “회원”이 신용카드 또는 전자화폐 등의 결제수단으로 재화 등의 대금을 지급한 때에는 지체 없이 당해 결제수단을 제공한 사업자로 하여금 재화 등의 대금의 청구를 정지 또는 취소하도록 요청합니다.\n③\t청약철회 등의 경우 공급받은 재화 등의 반환에 필요한 비용은 이용자가 부담합니다. “회사”는 “회원”에게 청약철회 등을 이유로 위약금 또는 손해배상을 청구하지 않습니다. 다만 재화 등의 내용이 표시·광고 내용과 다르거나 계약내용과 다르게 이행되어 청약철회 등을 하는 경우 재화 등의 반환에 필요한 비용은 “회사”가 부담합니다.\n\n제18조(개인정보보호)\n①\t“회사”는 “회원”의 개인정보 수집시 서비스제공을 위하여 필요한 범위에서 최소한의 개인정보를 수집합니다. \n②\t“회사”는 회원가입시 구매계약이행에 필요한 정보를 미리 수집하지 않습니다. 다만, 관련 법령상 의무이행을 위하여 구매계약 이전에 본인확인이 필요한 경우로서 최소한의 특정 개인정보를 수집하는 경우에는 그러하지 아니합니다.\n③\t“회사”는 “회원”의 개인정보를 수집·이용하는 때에는 당해 “회원”에게 그 목적을 고지하고 동의를 받습니다. \n④\t“회사”는 수집된 개인정보를 목적외의 용도로 이용할 수 없으며, 새로운 이용목적이 발생한 경우 또는 제3자에게 제공하는 경우에는 이용·제공단계에서 당해 “회원”에게 그 목적을 고지하고 동의를 받습니다. 다만, 관련 법령에 달리 정함이 있는 경우에는 예외로 합니다.\n⑤\t“회사”는 제2항과 제3항에 의해 이용자의 동의를 받아야 하는 경우에는 개인정보관리 책임자의 신원(소속, 성명 및 전화번호, 기타 연락처), 정보의 수집목적 및 이용목적, 제3자에 대한 정보제공 관련사항(제공받은자, 제공목적 및 제공할 정보의 내용) 등 「개인정보보호법」 제17조제2항이 규정한 사항을 미리 명시하거나 고지해야 하며 “회원”은 언제든지 이 동의를 철회할 수 있습니다.\n⑥\t“회원”은 언제든지 “회사”가 가지고 있는 자신의 개인정보에 대해 열람 및 오류정정을 요구할 수 있으며 “회사”는 이에 대해 지체 없이 필요한 조치를 취할 의무를 집니다. “회원”이 오류의 정정을 요구한 경우에는 “회사”는 그 오류를 정정할 때까지 당해 개인정보를 이용하지 않습니다.\n⑦\t“회사”는 개인정보 보호를 위하여 “회원”의 개인정보를 취급하는 자를 최소한으로 제한하여야 하며 신용카드, 은행계좌 등을 포함한 “회원”의 개인정보의 분실, 도난, 유출, 동의 없는 제3자 제공, 변조 등으로 인한 “회원”의 손해에 대하여 모든 책임을 집니다.\n⑧\t“회사” 또는 그로부터 개인정보를 제공받은 제3자는 개인정보의 수집목적 또는 제공받은 목적을 달성한 때에는 당해 개인정보를 지체 없이 파기합니다.\n⑨\t“회사”는 개인정보의 수집·이용·제공에 관한 동의 란을 미리 선택한 것으로 설정해두지 않습니다. 또한 개인정보의 수집·이용·제공에 관한 이용자의 동의거절시 제한되는 서비스를 구체적으로 명시하고, 필수수집항목이 아닌 개인정보의 수집·이용·제공에 관한 이용자의 동의 거절을 이유로 회원가입 등 서비스 제공을 제한하거나 거절하지 않습니다.\n\n제19조(회사의 의무)\n①\t“회사”는 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 이 약관이 정하는 바에 따라 지속적이고, 안정적으로 재화․용역을 제공하는데 최선을 다하여야 합니다.\n②\t“회사”는 “회원”이 안전하게 인터넷 서비스를 이용할 수 있도록 “회원”의 개인정보 (신용정보 포함)보호를 위한 보안 시스템을 갖추어야 합니다.\n③\t“회사”가 상품이나 용역에 대하여 「표시․광고의 공정화에 관한 법률」 제3조 소정의 부당한 표시․광고행위를 함으로써 “회사”가 손해를 입은 때에는 이를 배상할 책임을 집니다.\n④\t“회사”는 “회원”이 원하지 않는 영리목적의 광고성 전자우편을 발송하지 않습니다.\n\n제20조(회원의 의무)\n①\t“회원”은 다음 행위를 하여서는 안됩니다.\n1)\t신청 또는 변경시 허위 내용의 등록\n2)\t타인의 명의, 카드정보, 계좌정보 등을 도용하여 “서비스”를 이용하는 행위\n3)\t“회사”가 게시한 정보의 변경\n4)\t“회사”가 정한 정보 이외의 정보(컴퓨터프로그램 등)등의 송신 또는 게시\n5)\t“회사”와 기타 제3자의 저작권 등 지적제산권에 대한 침해\n6)\t“회사”와 기타 제 3자의 명예를 손상시키거나 업무를 방해하는 행위\n7)\t외설 또는 폭력적인 메시지 , 화상, 음성, 기타 공서양속에 반하는 정보를 “서비스”에 공개 또는 게시하는 행위\n8)\t고의로 제 3자 및 타인에게 “아이디” 또는 “비밀번호”를 공유하여 “회사”의 영리목적에 침해를 가하는 행위\n9)\t기타 위법, 탈법 또는 부정한 목적으로 “서비스”를 이용하는 행위\n②\t“회사”는 “회원”이 전 항의 사항을 위반하고 있다고 의심할 만한 합리적인 근거가 있는 경우 “회원”에게 해당근거를 제시하고 소명 할 수 있는 기회를 제공합니다.\n③\t“회원”이 본 조의 금지의무를 위반한 경우 “회사”는 “회원”이 요청하는 “서비스”를 거부하거나 “서비스”의 중지 또는 회원자격 상실 등의 조치를 취할 수 있습니다.\n④\t“회사”는 필요한 경우 “회원”의 금지의무 위반행위 사실을 관련 정보기관 또는 사법기관에 통지 할 수 있습니다.\n\n제21조(분쟁해결)\n①\t“회사”는 “회원”이 제기하는 정당한 의견이나 불만을 반영하고 그 피해를 처리하기 위한 노력을 해야 합니다.\n②\t“회사”는 “회원”으로부터 제출되는 불만사항 및 의견을 우선적으로 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 “회원”에게 그 사유와 처리일정을 즉시 통보합니다.\n③\t“회사”와 “회원” 간에 발생한 분쟁과 관련하여 “회원”의 피해구제신청이 있는 경우에는 공정거래위원회 또는 시도지사가 의뢰하는 분쟁조정기관의 조정에 따를 수 있습니다.\n\n제22조(재판권 및 준거법)\n이 약관은 대한민국 법률에 따라 규율되고 해석되며, “회사”와 “회원” 간에 발생한 분쟁으로 소송이 제기되는 경우, 법령이 정한 절차에 따른 법원을 관할법원으로 합니다.\n\n제23조(재판권 및 준거법)\n이 약관은 대한민국 법률에 따라 규율되고 해석되며, “회사”와 “회원” 간에 발생한 분쟁으로 소송이 제기되는 경우, 법령이 정한 절차에 따른 법원을 관할법원으로 합니다.\n\n제24조(기타 사항)\n본 약관에서 정하지 아니한 사항이나 해석상 이의가 있는 경우에는 관계 법규 및 상관례에 따릅니다.\n부칙\n본 약관은 2024년 3월 19일부터 적용합니다.\n<끝>'
};
const htmlContent = ref("");

const closeSections = (html, sections) => {
  if (sections.inBigTitleSection) {
    html += `</div>`;
    sections.inBigTitleSection = false;
  }
  if (sections.inRegularSection) {
    html += `</div>`;
    sections.inRegularSection = false;
  }
  if (sections.inIndent2Section) {
    html += `</div>`;
    sections.inIndent2Section = false;
  }
  return html;
};

const handleBigTitle = (line, html, sections) => {
  html = closeSections(html, sections);
  html += `<p class="big-title">${line}</p><div>`;
  sections.inBigTitleSection = true;
  return html;
};

const handleIndent1 = (line, html, sections) => {
  html = closeSections(html, sections);
  html += `<p class="indent1">${line}</p>`;
  return html;
};

const handleIndent2 = (line, html, sections) => {
  if (sections.inIndent2Section) {
    html += `</div>`;
    sections.inIndent2Section = false;
  }
  html += `<div class="indent2"><p>${line}</p>`;
  sections.inIndent2Section = true;
  return html;
};

const handleRegular = (line, html, sections) => {
  if (!sections.inRegularSection) {
    html += `<div class="inners">`;
    sections.inRegularSection = true;
  }
  html += `<p>${line}</p>`;
  return html;
};

const jsonToHtml = (json) => {
  let html = "";
  let lines = json.terms.split("\n");
  let sections = {
    inBigTitleSection: false,
    inRegularSection: false,
    inIndent2Section: false
  };

  lines.forEach((line) => {
    if (line.trim() === "") return; // 빈 줄은 무시

    if (line.match(/^\s*제\d+조/)) {
      html = handleBigTitle(line, html, sections);
    } else if (line.match(/^\s*[①-⑳]/)) {
      html = handleIndent1(line, html, sections);
    } else if (line.match(/^\s*[가-힣]\)/)) {
      html = handleIndent2(line, html, sections);
    } else {
      html = handleRegular(line, html, sections);
    }
  });

  html = closeSections(html, sections);
  return html;
};

onMounted(() => {
  htmlContent.value = jsonToHtml(jsonData);
});
</script>

<template>
  <div id="container">
    <div id="title">서비스이용약관</div>
    <div id="content" v-html="htmlContent"></div>
  </div>
</template>

<style>
body {
  width: auto;
  height: auto;
  overflow-y: scroll;
  border: none;
}

#container {
  padding: 80px;
}

#container > #title {
  color: #212936;
  font-size: 24px;
  font-weight: bold;
}

#container > #content {
  color: #394150;
  font-size: 18px;
  line-height: 1.3;
  padding-right: 5px;
  white-space: pre-wrap;
}

#container > #content p {
  margin-left: 20px;
}

#container > #content .big-title {
  font-size: 20px;
  font-weight: bold;
  margin-top: 30px;
  margin-bottom: 5px;
}

#container > #content .indent1 {
  margin-left: 40px;
}

#container > #content .inners {
  padding-left: 30px;
  margin-top: 10px;
  margin-bottom: 20px;
}

#container > #content .indent2 > p:nth-child(1) {
  margin: 5px 0 10px 20px;
  padding-left: 20px;
  font-weight: bold;
}

#container > #content .indent2 > p:not(:nth-child(1)) {
  padding-left: 40px;
}
</style>
